In [365]:
import pandas as pd

In [366]:
s = pd.Series([10,20,30,40,50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [367]:
s.shape

(5,)

In [368]:
s.dtype

dtype('int64')

In [369]:
s.name = "calories"

In [370]:
s

0    10
1    20
2    30
3    40
4    50
Name: calories, dtype: int64

In [371]:
index = ['apple', 'banana', 'orange', 'cherry', 'mango']
s.index = index

In [372]:
s

apple     10
banana    20
orange    30
cherry    40
mango     50
Name: calories, dtype: int64

In [373]:
s['apple']

np.int64(10)

In [374]:
s.loc['cherry']

np.int64(40)

In [375]:
print(s.loc['banana'])

20

In [376]:
s['banana':'cherry']

banana    20
orange    30
cherry    40
Name: calories, dtype: int64

In [377]:
s.loc['banana':'cherry']

banana    20
orange    30
cherry    40
Name: calories, dtype: int64

In [378]:
s

apple     10
banana    20
orange    30
cherry    40
mango     50
Name: calories, dtype: int64

In [379]:
# if we only know the value 'apple' and find the index position
s.index.get_loc('apple')

0

In [380]:
# change index apple to kiwi
index[0] = 'kiwi'
s.index = index
s

kiwi      10
banana    20
orange    30
cherry    40
mango     50
Name: calories, dtype: int64

In [381]:
# series

series = {
    'apple': 10,
    'banana': 20,
    'orange': 30,
    'cherry': 40,
    'mango': 50,
    'java beans': 60,
    'grapes': 70
}
s = pd.Series(series, name='calories')
s

apple         10
banana        20
orange        30
cherry        40
mango         50
java beans    60
grapes        70
Name: calories, dtype: int64

In [382]:
s.name = "fruits"
s.index.name = "fruit names"
s

fruit names
apple         10
banana        20
orange        30
cherry        40
mango         50
java beans    60
grapes        70
Name: fruits, dtype: int64

In [383]:
s[s>50]

fruit names
java beans    60
grapes        70
Name: fruits, dtype: int64

In [384]:
s[(s>20) & (s<60)]

fruit names
orange    30
cherry    40
mango     50
Name: fruits, dtype: int64

In [385]:
s['orange'] = 35
s

fruit names
apple         10
banana        20
orange        35
cherry        40
mango         50
java beans    60
grapes        70
Name: fruits, dtype: int64

In [386]:
# Dataframe
import numpy as np
data = {
    'name' : ['Anan', 'Banan', 'Canan', 'Danan'],
    'age' : [21, 22, np.nan,np.nan ],
    'department' : ['CSE', 'ECE', 'MECH', 'CIVIL'],
    'salary' : [ np.nan, 60000, 55000, 65000]
}

df = pd.DataFrame(data)
df

    name   age department   salary
0   Anan  21.0        CSE      NaN
1  Banan  22.0        ECE  60000.0
2  Canan   NaN       MECH  55000.0
3  Danan   NaN      CIVIL  65000.0

In [387]:
df.head(2)

    name   age department   salary
0   Anan  21.0        CSE      NaN
1  Banan  22.0        ECE  60000.0

In [388]:
df.tail(2)

    name  age department   salary
2  Canan  NaN       MECH  55000.0
3  Danan  NaN      CIVIL  65000.0

In [389]:
df.isnull().sum()

name          0
age           2
department    0
salary        1
dtype: int64

In [390]:
df.loc[1:3, ['name', 'salary']]     #select rows 1 to 3 and columns --> name and salary

    name   salary
1  Banan  60000.0
2  Canan  55000.0
3  Danan  65000.0

In [391]:
df.loc[0:4, ['name', 'salary', 'age']]

    name   salary   age
0   Anan      NaN  21.0
1  Banan  60000.0  22.0
2  Canan  55000.0   NaN
3  Danan  65000.0   NaN

In [392]:
df.iloc[1:3]

    name   age department   salary
1  Banan  22.0        ECE  60000.0
2  Canan   NaN       MECH  55000.0

In [393]:
df[['age']]

    age
0  21.0
1  22.0
2   NaN
3   NaN

In [394]:
df[['age', 'salary']]

    age   salary
0  21.0      NaN
1  22.0  60000.0
2   NaN  55000.0
3   NaN  65000.0

In [395]:
df

    name   age department   salary
0   Anan  21.0        CSE      NaN
1  Banan  22.0        ECE  60000.0
2  Canan   NaN       MECH  55000.0
3  Danan   NaN      CIVIL  65000.0

In [396]:
df.drop(['age'], axis=1, inplace=True)    # inplace = True to make changes in original dataframe

In [397]:
df
# age column is deleted now.

    name department   salary
0   Anan        CSE      NaN
1  Banan        ECE  60000.0
2  Canan       MECH  55000.0
3  Danan      CIVIL  65000.0

In [398]:
# add new column 'age' with default values and some of then are nan
df['age'] = [21, 22, np.nan, np.nan]

In [399]:
df

    name department   salary   age
0   Anan        CSE      NaN  21.0
1  Banan        ECE  60000.0  22.0
2  Canan       MECH  55000.0   NaN
3  Danan      CIVIL  65000.0   NaN

In [400]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        4 non-null      object
 1   department  4 non-null      object
 2   salary      3 non-null      float64
 3   age         2 non-null      float64
dtypes: float64(2), object(2)
memory usage: 260.0+ bytes

In [401]:
df.shape

(4, 4)

In [402]:
df.size

16

In [403]:
df.describe()

        salary        age
count      3.0   2.000000
mean   60000.0  21.500000
std     5000.0   0.707107
min    55000.0  21.000000
25%    57500.0  21.250000
50%    60000.0  21.500000
75%    62500.0  21.750000
max    65000.0  22.000000

In [404]:
df['age'].describe()

count     2.000000
mean     21.500000
std       0.707107
min      21.000000
25%      21.250000
50%      21.500000
75%      21.750000
max      22.000000
Name: age, dtype: float64

In [405]:
df['salary'] = df['salary']+1000
df

    name department   salary   age
0   Anan        CSE      NaN  21.0
1  Banan        ECE  61000.0  22.0
2  Canan       MECH  56000.0   NaN
3  Danan      CIVIL  66000.0   NaN

In [406]:
df['salary'] = df['salary'].fillna(df['salary'].mean())
df

    name department   salary   age
0   Anan        CSE  61000.0  21.0
1  Banan        ECE  61000.0  22.0
2  Canan       MECH  56000.0   NaN
3  Danan      CIVIL  66000.0   NaN

In [407]:
# renaming columns name
df.rename(columns = {
    'name': 'full_name',
    'age': 'age_in_years'
}, inplace=True)
df

  full_name department   salary  age_in_years
0      Anan        CSE  61000.0          21.0
1     Banan        ECE  61000.0          22.0
2     Canan       MECH  56000.0           NaN
3     Danan      CIVIL  66000.0           NaN

In [408]:
df['department'].unique()

array(['CSE', 'ECE', 'MECH', 'CIVIL'], dtype=object)

In [409]:
df[['department']].value_counts()

department
CIVIL         1
CSE           1
ECE           1
MECH          1
Name: count, dtype: int64

In [410]:
df['promoted_salary'] = df['salary'] * 1.4
df

  full_name department   salary  age_in_years  promoted_salary
0      Anan        CSE  61000.0          21.0          85400.0
1     Banan        ECE  61000.0          22.0          85400.0
2     Canan       MECH  56000.0           NaN          78400.0
3     Danan      CIVIL  66000.0           NaN          92400.0

In [411]:
# Data Cleaning

df.isnull().sum()

full_name          0
department         0
salary             0
age_in_years       2
promoted_salary    0
dtype: int64

In [412]:
df.dropna(inplace=True)
df

  full_name department   salary  age_in_years  promoted_salary
0      Anan        CSE  61000.0          21.0          85400.0
1     Banan        ECE  61000.0          22.0          85400.0

In [413]:
# add more 10 data to dataset with default values and no null value  to extend the dataframe and add to original dataframe
new_data = {
    'full_name': ['Eman e', 'Fanan f', 'Ganan g', 'Hanan h', 'Iman i', 'Janan j', 'Kanan k', 'Lanan l', 'Manan m', 'Manan m'],
    'age_in_years': [23, 24, 25, 26, 27, 28, 29, 30, 31, 31],
    'department': ['CSE', 'ECE', 'MECH', 'CIVIL', 'CSE', 'ECE', 'MECH', 'CIVIL', 'CSE', 'CSE'],
    'salary': [70000, 72000, 68000, 75000, 71000, 73000, 69000, 76000, 74000, 74000],
    'promoted_salary': [98000.0, 100800.0, 95200.0, 105000.0, 99400.0, 102200.0, 96600.0, 106400.0, 103600.0, 103600.0]
}
new_df = pd.DataFrame(new_data)
new_df  
df = pd.concat([df, new_df], ignore_index=True)
df

   full_name department   salary  age_in_years  promoted_salary
0       Anan        CSE  61000.0          21.0          85400.0
1      Banan        ECE  61000.0          22.0          85400.0
2     Eman e        CSE  70000.0          23.0          98000.0
3    Fanan f        ECE  72000.0          24.0         100800.0
4    Ganan g       MECH  68000.0          25.0          95200.0
5    Hanan h      CIVIL  75000.0          26.0         105000.0
6     Iman i        CSE  71000.0          27.0          99400.0
7    Janan j        ECE  73000.0          28.0         102200.0
8    Kanan k       MECH  69000.0          29.0          96600.0
9    Lanan l      CIVIL  76000.0          30.0         106400.0
10   Manan m        CSE  74000.0          31.0         103600.0
11   Manan m        CSE  74000.0          31.0         103600.0

In [414]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   full_name        12 non-null     object
 1   department       12 non-null     object
 2   salary           12 non-null     float64
 3   age_in_years     12 non-null     float64
 4   promoted_salary  12 non-null     float64
dtypes: float64(3), object(2)
memory usage: 612.0+ bytes

In [415]:
df.dropna(how='any')    # drop rows with any null values
df.dropna(how='all')   # drop rows with all null values

   full_name department   salary  age_in_years  promoted_salary
0       Anan        CSE  61000.0          21.0          85400.0
1      Banan        ECE  61000.0          22.0          85400.0
2     Eman e        CSE  70000.0          23.0          98000.0
3    Fanan f        ECE  72000.0          24.0         100800.0
4    Ganan g       MECH  68000.0          25.0          95200.0
5    Hanan h      CIVIL  75000.0          26.0         105000.0
6     Iman i        CSE  71000.0          27.0          99400.0
7    Janan j        ECE  73000.0          28.0         102200.0
8    Kanan k       MECH  69000.0          29.0          96600.0
9    Lanan l      CIVIL  76000.0          30.0         106400.0
10   Manan m        CSE  74000.0          31.0         103600.0
11   Manan m        CSE  74000.0          31.0         103600.0

In [416]:
# fill nas with mean value of respective column
df['age_in_years'] = df['age_in_years'].fillna(df['age_in_years'].mean())
df['salary'] = df['salary'].fillna(df['salary'].mean())
df['promoted_salary'] = df['promoted_salary'].fillna(df['promoted_salary'].mean())
df

   full_name department   salary  age_in_years  promoted_salary
0       Anan        CSE  61000.0          21.0          85400.0
1      Banan        ECE  61000.0          22.0          85400.0
2     Eman e        CSE  70000.0          23.0          98000.0
3    Fanan f        ECE  72000.0          24.0         100800.0
4    Ganan g       MECH  68000.0          25.0          95200.0
5    Hanan h      CIVIL  75000.0          26.0         105000.0
6     Iman i        CSE  71000.0          27.0          99400.0
7    Janan j        ECE  73000.0          28.0         102200.0
8    Kanan k       MECH  69000.0          29.0          96600.0
9    Lanan l      CIVIL  76000.0          30.0         106400.0
10   Manan m        CSE  74000.0          31.0         103600.0
11   Manan m        CSE  74000.0          31.0         103600.0

In [417]:
df['age_in_years'].fillna(method='ffill')   # forward fill
df['age_in_years'].fillna(method='bfill')   # backward fill
df

C:\Users\aanan\AppData\Local\Temp\ipykernel_4320\789449771.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['age_in_years'].fillna(method='ffill')   # forward fill
C:\Users\aanan\AppData\Local\Temp\ipykernel_4320\789449771.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['age_in_years'].fillna(method='bfill')   # backward fill

   full_name department   salary  age_in_years  promoted_salary
0       Anan        CSE  61000.0          21.0          85400.0
1      Banan        ECE  61000.0          22.0          85400.0
2     Eman e        CSE  70000.0          23.0          98000.0
3    Fanan f        ECE  72000.0          24.0         100800.0
4    Ganan g       MECH  68000.0          25.0          95200.0
5    Hanan h      CIVIL  75000.0          26.0         105000.0
6     Iman i        CSE  71000.0          27.0          99400.0
7    Janan j        ECE  73000.0          28.0         102200.0
8    Kanan k       MECH  69000.0          29.0          96600.0
9    Lanan l      CIVIL  76000.0          30.0         106400.0
10   Manan m        CSE  74000.0          31.0         103600.0
11   Manan m        CSE  74000.0          31.0         103600.0

In [418]:
df['age_in_years'].bfill()
df

   full_name department   salary  age_in_years  promoted_salary
0       Anan        CSE  61000.0          21.0          85400.0
1      Banan        ECE  61000.0          22.0          85400.0
2     Eman e        CSE  70000.0          23.0          98000.0
3    Fanan f        ECE  72000.0          24.0         100800.0
4    Ganan g       MECH  68000.0          25.0          95200.0
5    Hanan h      CIVIL  75000.0          26.0         105000.0
6     Iman i        CSE  71000.0          27.0          99400.0
7    Janan j        ECE  73000.0          28.0         102200.0
8    Kanan k       MECH  69000.0          29.0          96600.0
9    Lanan l      CIVIL  76000.0          30.0         106400.0
10   Manan m        CSE  74000.0          31.0         103600.0
11   Manan m        CSE  74000.0          31.0         103600.0

In [419]:
df['full_name'].replace({
    'Anan': 'Aanand'
}, inplace=True)
df

C:\Users\aanan\AppData\Local\Temp\ipykernel_4320\1721466166.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['full_name'].replace({

   full_name department   salary  age_in_years  promoted_salary
0     Aanand        CSE  61000.0          21.0          85400.0
1      Banan        ECE  61000.0          22.0          85400.0
2     Eman e        CSE  70000.0          23.0          98000.0
3    Fanan f        ECE  72000.0          24.0         100800.0
4    Ganan g       MECH  68000.0          25.0          95200.0
5    Hanan h      CIVIL  75000.0          26.0         105000.0
6     Iman i        CSE  71000.0          27.0          99400.0
7    Janan j        ECE  73000.0          28.0         102200.0
8    Kanan k       MECH  69000.0          29.0          96600.0
9    Lanan l      CIVIL  76000.0          30.0         106400.0
10   Manan m        CSE  74000.0          31.0         103600.0
11   Manan m        CSE  74000.0          31.0         103600.0

In [420]:
# find the duplicate rows
df_dup = df[df.duplicated()]
df_dup

   full_name department   salary  age_in_years  promoted_salary
11   Manan m        CSE  74000.0          31.0         103600.0

In [421]:
# drop duplicates and make changes in original dataframe
df.drop_duplicates(inplace=True)
df

   full_name department   salary  age_in_years  promoted_salary
0     Aanand        CSE  61000.0          21.0          85400.0
1      Banan        ECE  61000.0          22.0          85400.0
2     Eman e        CSE  70000.0          23.0          98000.0
3    Fanan f        ECE  72000.0          24.0         100800.0
4    Ganan g       MECH  68000.0          25.0          95200.0
5    Hanan h      CIVIL  75000.0          26.0         105000.0
6     Iman i        CSE  71000.0          27.0          99400.0
7    Janan j        ECE  73000.0          28.0         102200.0
8    Kanan k       MECH  69000.0          29.0          96600.0
9    Lanan l      CIVIL  76000.0          30.0         106400.0
10   Manan m        CSE  74000.0          31.0         103600.0

In [422]:
# split first and last names into two different columns
df[['first_name', 'last_name']] = df['full_name'].str.split(' ', expand=True, n=1)
df

,full_name,department,salary,age_in_years,promoted_salary,first_name,last_name
0,Aanand,CSE,61000.0,21.0,85400.0,Aanand,None
1,Banan,ECE,61000.0,22.0,85400.0,Banan,None
2,Eman e,CSE,70000.0,23.0,98000.0,Eman,e
3,Fanan f,ECE,72000.0,24.0,100800.0,Fanan,f
4,Ganan g,MECH,68000.0,25.0,95200.0,Ganan,g
5,Hanan h,CIVIL,75000.0,26.0,105000.0,Hanan,h
6,Iman i,CSE,71000.0,27.0,99400.0,Iman,i
7,Janan j,ECE,73000.0,28.0,102200.0,Janan,j
8,Kanan k,MECH,69000.0,29.0,96600.0,Kanan,k
9,Lanan l,CIVIL,76000.0,30.0,106400.0,Lanan,l
10,Manan m,CSE,74000.0,31.0,103600.0,Manan,m

In [423]:
location_data = {
    'location': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', 'San Diego', 'Dallas', 'San Jose', 'Austin', 'Jacksonville', 'Fort Worth', 'Columbus'],
    'department': ['CSE', 'ECE', 'MECH', 'CIVIL', 'CSE', 'ECE', 'MECH', 'CIVIL', 'CSE', 'CSE', 'CSE', 'ECE', 'MECH', 'CIVIL']
}
df3 = pd.DataFrame(location_data)
df3

        location department
0       New York        CSE
1    Los Angeles        ECE
2        Chicago       MECH
3        Houston      CIVIL
4        Phoenix        CSE
5   Philadelphia        ECE
6    San Antonio       MECH
7      San Diego      CIVIL
8         Dallas        CSE
9       San Jose        CSE
10        Austin        CSE
11  Jacksonville        ECE
12    Fort Worth       MECH
13      Columbus      CIVIL

In [424]:
# concat df and df3 on department column
df = pd.concat([df, df3], axis=1)
df

,full_name,department,salary,age_in_years,promoted_salary,first_name,last_name,location,department
0,Aanand,CSE,61000.0,21.0,85400.0,Aanand,None,New York,CSE
1,Banan,ECE,61000.0,22.0,85400.0,Banan,None,Los Angeles,ECE
2,Eman e,CSE,70000.0,23.0,98000.0,Eman,e,Chicago,MECH
3,Fanan f,ECE,72000.0,24.0,100800.0,Fanan,f,Houston,CIVIL
4,Ganan g,MECH,68000.0,25.0,95200.0,Ganan,g,Phoenix,CSE
5,Hanan h,CIVIL,75000.0,26.0,105000.0,Hanan,h,Philadelphia,ECE
6,Iman i,CSE,71000.0,27.0,99400.0,Iman,i,San Antonio,MECH
7,Janan j,ECE,73000.0,28.0,102200.0,Janan,j,San Diego,CIVIL
8,Kanan k,MECH,69000.0,29.0,96600.0,Kanan,k,Dallas,CSE
9,Lanan l,CIVIL,76000.0,30.0,106400.0,Lanan,l,San Jose,CSE
10,Manan m,CSE,74000.0,31.0,103600.0,Manan,m,Austin,CSE
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Jacksonville,ECE
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Fort Worth,MECH
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Columbus,CIVIL

In [ ]:
# merge  df and df3 on department column, keeping only matching rows

df = pd.merge(df, df3, on='department', how='inner')
df

In [435]:
df.columns.tolist()

['full_name',
 'department',
 'salary',
 'age_in_years',
 'promoted_salary',
 'first_name',
 'last_name',
 'location',
 'department']

In [439]:
# keep the first occurrence of each column name, drop later duplicates and update in original dataframe
df = df.loc[:, ~df.columns.duplicated()]
# verify
print(df.columns.tolist())
df.head()

['full_name', 'department', 'salary', 'age_in_years', 'promoted_salary', 'first_name', 'last_name', 'location']

,full_name,department,salary,age_in_years,promoted_salary,first_name,last_name,location
0,Aanand,CSE,61000.0,21.0,85400.0,Aanand,None,New York
1,Banan,ECE,61000.0,22.0,85400.0,Banan,None,Los Angeles
2,Eman e,CSE,70000.0,23.0,98000.0,Eman,e,Chicago
3,Fanan f,ECE,72000.0,24.0,100800.0,Fanan,f,Houston
4,Ganan g,MECH,68000.0,25.0,95200.0,Ganan,g,Phoenix

In [437]:
df

,full_name,department,salary,age_in_years,promoted_salary,first_name,last_name,location,department
0,Aanand,CSE,61000.0,21.0,85400.0,Aanand,None,New York,CSE
1,Banan,ECE,61000.0,22.0,85400.0,Banan,None,Los Angeles,ECE
2,Eman e,CSE,70000.0,23.0,98000.0,Eman,e,Chicago,MECH
3,Fanan f,ECE,72000.0,24.0,100800.0,Fanan,f,Houston,CIVIL
4,Ganan g,MECH,68000.0,25.0,95200.0,Ganan,g,Phoenix,CSE
5,Hanan h,CIVIL,75000.0,26.0,105000.0,Hanan,h,Philadelphia,ECE
6,Iman i,CSE,71000.0,27.0,99400.0,Iman,i,San Antonio,MECH
7,Janan j,ECE,73000.0,28.0,102200.0,Janan,j,San Diego,CIVIL
8,Kanan k,MECH,69000.0,29.0,96600.0,Kanan,k,Dallas,CSE
9,Lanan l,CIVIL,76000.0,30.0,106400.0,Lanan,l,San Jose,CSE
10,Manan m,CSE,74000.0,31.0,103600.0,Manan,m,Austin,CSE
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Jacksonville,ECE
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Fort Worth,MECH
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Columbus,CIVIL

In [440]:
# drop the full_name column
df.drop(columns=['full_name'], inplace=True)

C:\Users\aanan\AppData\Local\Temp\ipykernel_4320\601586370.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop(columns=['full_name'], inplace=True)

In [441]:
df

,department,salary,age_in_years,promoted_salary,first_name,last_name,location
0,CSE,61000.0,21.0,85400.0,Aanand,None,New York
1,ECE,61000.0,22.0,85400.0,Banan,None,Los Angeles
2,CSE,70000.0,23.0,98000.0,Eman,e,Chicago
3,ECE,72000.0,24.0,100800.0,Fanan,f,Houston
4,MECH,68000.0,25.0,95200.0,Ganan,g,Phoenix
5,CIVIL,75000.0,26.0,105000.0,Hanan,h,Philadelphia
6,CSE,71000.0,27.0,99400.0,Iman,i,San Antonio
7,ECE,73000.0,28.0,102200.0,Janan,j,San Diego
8,MECH,69000.0,29.0,96600.0,Kanan,k,Dallas
9,CIVIL,76000.0,30.0,106400.0,Lanan,l,San Jose
10,CSE,74000.0,31.0,103600.0,Manan,m,Austin
11,NaN,NaN,NaN,NaN,NaN,NaN,Jacksonville
12,NaN,NaN,NaN,NaN,NaN,NaN,Fort Worth
13,NaN,NaN,NaN,NaN,NaN,NaN,Columbus

In [442]:
# arrange columns in specific order
df = df[['first_name', 'last_name', 'age_in_years', 'department', 'location', 'salary', 'promoted_salary']]
df

,first_name,last_name,age_in_years,department,location,salary,promoted_salary
0,Aanand,None,21.0,CSE,New York,61000.0,85400.0
1,Banan,None,22.0,ECE,Los Angeles,61000.0,85400.0
2,Eman,e,23.0,CSE,Chicago,70000.0,98000.0
3,Fanan,f,24.0,ECE,Houston,72000.0,100800.0
4,Ganan,g,25.0,MECH,Phoenix,68000.0,95200.0
5,Hanan,h,26.0,CIVIL,Philadelphia,75000.0,105000.0
6,Iman,i,27.0,CSE,San Antonio,71000.0,99400.0
7,Janan,j,28.0,ECE,San Diego,73000.0,102200.0
8,Kanan,k,29.0,MECH,Dallas,69000.0,96600.0
9,Lanan,l,30.0,CIVIL,San Jose,76000.0,106400.0
10,Manan,m,31.0,CSE,Austin,74000.0,103600.0
11,NaN,NaN,NaN,NaN,Jacksonville,NaN,NaN
12,NaN,NaN,NaN,NaN,Fort Worth,NaN,NaN
13,NaN,NaN,NaN,NaN,Columbus,NaN,NaN

In [426]:
# import csv file from local folder
df_csv = pd.read_csv('Housing.csv')
df_csv

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished